Core/src/src/Catalogs/ШаблоныЗаполнения/ШаблоныЗаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЗаполнения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяСхемыКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСоответсвияРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.ВидыОперацийПоступлениеНаСчет</types>
      <types>EnumRef.ВидыОперацийПоступлениеВКассу</types>
      <types>EnumRef.ВидыОперацийРасходИзКассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбменаСИнтернетБанком</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекСчетПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <comment>ONESOFT-3063</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКредитаЗайма</name>
    <comment>ONESOFT-3063</comment>
    <type>
      <types>DocumentRef.ДоговорКредитаИЗайма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСуммы</name>
    <comment>ONESOFT-3063</comment>
    <type>
      <types>EnumRef.ТипыСуммГрафикаКредитовИЗаймов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <comment>ONESOFT-3463</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/src/Enums/ВидыОперацийПоступлениеНаСчет/ВидыОперацийПоступлениеНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеНаСчет</name>
  <enumValues>
    <name>ОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОтПодотчетника</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВалюты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗаймаСотрудником</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоКартам</name>
  </enumValues>
  <enumValues>
    <name>ВзносНаличными</name>
  </enumValues>
  <enumValues>
    <name>ПереводСДругогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ОтКурьерскойКомпанииПочты</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенегОтСотрудника</name>
  </enumValues>
  <enumValues>
    <name>AzRyОтПоставщикаОтПодотчетника</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Enums/ВидыОперацийРасходСоСчета/ВидыОперацийРасходСоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходСоСчета</name>
  <enumValues>
    <name>Поставщику</name>
  </enumValues>
  <enumValues>
    <name>Покупателю</name>
  </enumValues>
  <enumValues>
    <name>Подотчетнику</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Налоги</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчеты</name>
  </enumValues>
  <enumValues>
    <name>РасчетыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКредитаКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежныеКарты</name>
  </enumValues>
  <enumValues>
    <name>НаРасходы</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличных</name>
  </enumValues>
  <enumValues>
    <name>ПереводНаДругойСчет</name>
  </enumValues>
  <enumValues>
    <name>ЗарплатаВРазрезеСотрудников</name>
    <comment>// Kuzmich, 23.02.2019,Зарплата по ведомости в разрезе сотрудников</comment>
  </enumValues>
  <enumValues>
    <name>AzRyПоставщикуПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ПенсионномуФонду</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/ШаблоныЗаполнения/ObjectModule.bsl
Функция ВидимостьКонтрагента() Экспорт
	
	Результат = 
	ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПокупателя 
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ОтПоставщика
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам//Паганини
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам//Malyshev 2024-05-24 ONESOFT-3063
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом//Malyshev 2024-05-24 ONESOFT-3063
	
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Покупателю	
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.Поставщику
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам //Malyshev 2024-05-24 ONESOFT-3063
	ИЛИ ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаКредитаКонтрагенту //Malyshev 2024-05-24 ONESOFT-3063
	
	;
	
	Возврат Результат;	  
КонецФункции	

Функция ВидимостьВидаУдержания() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПенсионномуФонду 
		)                                        
	)	
	;
	Возврат Результат;	  
КонецФункции	                
	  
Функция ВидимостьСотрудника() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
			(
			ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику
			)
	)
	ИЛИ
	(ЭтотОбъект.СсылкаИсточника = "ПоступлениеНаСчет" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником
		)
	)
	;
	Возврат Результат;
	
КонецФункции	

Функция ВидимостьДоговораКредитаЗайма() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику
		ИЛИ 
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ВыдачаКредитаКонтрагенту
		ИЛИ 
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам //это ВозвратКредита
		)
	)
	ИЛИ 
	(ЭтотОбъект.СсылкаИсточника = "ПоступлениеНаСчет" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником
		ИЛИ
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам //это ПолучениеКредита		
		ИЛИ
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом
		
		)
	)
	; 
	Возврат Результат;
КонецФункции	

Функция ВидимостьТипаСуммы() Экспорт
	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.РасчетыПоКредитам //это ВозвратКредита 
	)	
	ИЛИ
	(ЭтотОбъект.СсылкаИсточника = "ПоступлениеНаСчет" и 
		(
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником
		ИЛИ
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаСчет.ВозвратКредитаКонтрагентом
		)
	)
	;
	Возврат Результат;

КонецФункции	
//+++ Дмгг, 11.04.2025, ONESOFT-3973 
Функция ЭтоРасходдСосчетаПереводСПометкойПеремещения() Экспорт

	Результат = 
	(ЭтотОбъект.СсылкаИсточника = "РасходСоСчета" и
		ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийРасходСоСчета.ПереводНаДругойСчет  
		И ЭтотОбъект.Перемещение)
	;
	Возврат Результат;	

КонецФункции // ЭтоРасходдСосчетаСпометкойПеремещения()
//--- Дмгг, 11.04.2025, ONESOFT-3973
